## Plan for AFT Root Module
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 308 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_cloudwatch_log_group.account_metadata_ssm will be created
  + resource "aws_cloudwatch_log_group" "account_metadata_ssm" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/aft-account-provisioning-framework-account-metadata-ssm"
      + retention_in_days = 90
      + tags_all          = {
          + "managed_by" = "AFT"
        }
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_cloudwatch_log_group.create_role will be created
  + resource "aws_cloudwatch_log_group" "create_role" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/aft-account-provisioning-framework-create-aft-execution-role"
      + retention_in_days = 90
      + tags_all          = {
          + "managed_by" = "AFT"
        }
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_cloudwatch_log_group.get_account_info will be created
  + resource "aws_cloudwatch_log_group" "get_account_info" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/aft-account-provisioning-framework-get-account-info"
      + retention_in_days = 90
      + tags_all          = {
          + "managed_by" = "AFT"
        }
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_cloudwatch_log_group.persist_metadata will be created
  + resource "aws_cloudwatch_log_group" "persist_metadata" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/aft-account-provisioning-framework-persist-metadata"
      + retention_in_days = 90
      + tags_all          = {
          + "managed_by" = "AFT"
        }
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_cloudwatch_log_group.tag_account will be created
  + resource "aws_cloudwatch_log_group" "tag_account" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/aft-account-provisioning-framework-tag-account"
      + retention_in_days = 90
      + tags_all          = {
          + "managed_by" = "AFT"
        }
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_cloudwatch_log_group.validate_request will be created
  + resource "aws_cloudwatch_log_group" "validate_request" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/aft-account-provisioning-framework-validate-request"
      + retention_in_days = 90
      + tags_all          = {
          + "managed_by" = "AFT"
        }
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_iam_role.aft_lambda_aft_account_provisioning_framework_create_role will be created
  + resource "aws_iam_role" "aft_lambda_aft_account_provisioning_framework_create_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "aft-account-provisioning-framework-lambda-create-role-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "managed_by" = "AFT"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_iam_role.aft_lambda_aft_account_provisioning_framework_get_account_info will be created
  + resource "aws_iam_role" "aft_lambda_aft_account_provisioning_framework_get_account_info" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "aft-account-provisioning-framework-lambda-get-account-info-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "managed_by" = "AFT"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_iam_role.aft_lambda_aft_account_provisioning_framework_persist_metadata will be created
  + resource "aws_iam_role" "aft_lambda_aft_account_provisioning_framework_persist_metadata" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "aft-account-provisioning-framework-lambda-persist-metadata-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "managed_by" = "AFT"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_iam_role.aft_lambda_aft_account_provisioning_framework_tag_account will be created
  + resource "aws_iam_role" "aft_lambda_aft_account_provisioning_framework_tag_account" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "aft-account-provisioning-framework-lambda-tag-account-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "managed_by" = "AFT"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_iam_role.aft_lambda_aft_account_provisioning_framework_validate_request will be created
  + resource "aws_iam_role" "aft_lambda_aft_account_provisioning_framework_validate_request" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "aft-account-provisioning-framework-validate-request-lambda-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "managed_by" = "AFT"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_iam_role.aft_states will be created
  + resource "aws_iam_role" "aft_states" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "states.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "aft-states-execution-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "managed_by" = "AFT"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_iam_role_policy.aft_invoke_aft_account_provisioning_framework_create_role will be created
  + resource "aws_iam_role_policy" "aft_invoke_aft_account_provisioning_framework_create_role" {
      + id     = (known after apply)
      + name   = "aft-lambda-invoke-aft_account_provisioning_framework-create-role-policy"
      + policy = (known after apply)
      + role   = (known after apply)
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_iam_role_policy.aft_invoke_aft_account_provisioning_framework_get_account_info will be created
  + resource "aws_iam_role_policy" "aft_invoke_aft_account_provisioning_framework_get_account_info" {
      + id     = (known after apply)
      + name   = "aft-lambda-invoke-aft-account-provisioning-framework-get-account-info-policy"
      + policy = (known after apply)
      + role   = (known after apply)
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_iam_role_policy.aft_invoke_aft_account_provisioning_framework_persist_metadata will be created
  + resource "aws_iam_role_policy" "aft_invoke_aft_account_provisioning_framework_persist_metadata" {
      + id     = (known after apply)
      + name   = "aft-lambda-invoke-aft-account-provisioning-framework-persist-metadata-policy"
      + policy = (known after apply)
      + role   = (known after apply)
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_iam_role_policy.aft_invoke_aft_account_provisioning_framework_tag_account will be created
  + resource "aws_iam_role_policy" "aft_invoke_aft_account_provisioning_framework_tag_account" {
      + id     = (known after apply)
      + name   = "aft-lambda-invoke-aft-account-provisioning-framework-tag-account-policy"
      + policy = (known after apply)
      + role   = (known after apply)
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_iam_role_policy.aft_invoke_aft_account_provisioning_framework_validate_request will be created
  + resource "aws_iam_role_policy" "aft_invoke_aft_account_provisioning_framework_validate_request" {
      + id     = (known after apply)
      + name   = "aft-lambda-invoke-aft-account-provisioning-framework-validate-request-policy"
      + policy = (known after apply)
      + role   = (known after apply)
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_iam_role_policy.aft_states will be created
  + resource "aws_iam_role_policy" "aft_states" {
      + id     = (known after apply)
      + name   = "aft-account-provisioning-framework-states-policy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "events:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = "states:StartExecution"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:states:ca-central-1:137554749751:stateMachine:aft-*"
                    },
                  + {
                      + Action   = [
                          + "lambda:InvokeFunction",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:lambda:ca-central-1:137554749751:function:aft-*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "sns:Publish",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:sns:ca-central-1:137554749751:aft-*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "codebuild:StartBuild",
                          + "codebuild:StopBuild",
                          + "codebuild:BatchGetBuilds",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:codebuild:ca-central-1:137554749751:project/aft-*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "events:PutTargets",
                          + "events:PutRule",
                          + "events:DescribeRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:events:ca-central-1:137554749751:rule/StepFunctionsGetEventForCodeBuildStartBuildRule",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_iam_role_policy_attachment.aft_account_provisioning_framework_create_role[0] will be created
  + resource "aws_iam_role_policy_attachment" "aft_account_provisioning_framework_create_role" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "aft-account-provisioning-framework-lambda-create-role-role"
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_iam_role_policy_attachment.aft_account_provisioning_framework_create_role[1] will be created
  + resource "aws_iam_role_policy_attachment" "aft_account_provisioning_framework_create_role" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaVPCAccessExecutionRole"
      + role       = "aft-account-provisioning-framework-lambda-create-role-role"
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_iam_role_policy_attachment.aft_account_provisioning_framework_get_account_info[0] will be created
  + resource "aws_iam_role_policy_attachment" "aft_account_provisioning_framework_get_account_info" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "aft-account-provisioning-framework-lambda-get-account-info-role"
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_iam_role_policy_attachment.aft_account_provisioning_framework_get_account_info[1] will be created
  + resource "aws_iam_role_policy_attachment" "aft_account_provisioning_framework_get_account_info" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaVPCAccessExecutionRole"
      + role       = "aft-account-provisioning-framework-lambda-get-account-info-role"
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_iam_role_policy_attachment.aft_account_provisioning_framework_persist_metadata[0] will be created
  + resource "aws_iam_role_policy_attachment" "aft_account_provisioning_framework_persist_metadata" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "aft-account-provisioning-framework-lambda-persist-metadata-role"
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_iam_role_policy_attachment.aft_account_provisioning_framework_persist_metadata[1] will be created
  + resource "aws_iam_role_policy_attachment" "aft_account_provisioning_framework_persist_metadata" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaVPCAccessExecutionRole"
      + role       = "aft-account-provisioning-framework-lambda-persist-metadata-role"
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_iam_role_policy_attachment.aft_account_provisioning_framework_tag_account[0] will be created
  + resource "aws_iam_role_policy_attachment" "aft_account_provisioning_framework_tag_account" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "aft-account-provisioning-framework-lambda-tag-account-role"
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_iam_role_policy_attachment.aft_account_provisioning_framework_tag_account[1] will be created
  + resource "aws_iam_role_policy_attachment" "aft_account_provisioning_framework_tag_account" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaVPCAccessExecutionRole"
      + role       = "aft-account-provisioning-framework-lambda-tag-account-role"
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_iam_role_policy_attachment.aft_account_provisioning_framework_validate_request[0] will be created
  + resource "aws_iam_role_policy_attachment" "aft_account_provisioning_framework_validate_request" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "aft-account-provisioning-framework-validate-request-lambda-role"
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_iam_role_policy_attachment.aft_account_provisioning_framework_validate_request[1] will be created
  + resource "aws_iam_role_policy_attachment" "aft_account_provisioning_framework_validate_request" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaVPCAccessExecutionRole"
      + role       = "aft-account-provisioning-framework-validate-request-lambda-role"
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.account_metadata_ssm will be created
  + resource "aws_lambda_function" "account_metadata_ssm" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + description                    = "AFT account provisioning framework - account_metadata_ssm"
      + filename                       = ".terraform/modules/account_factory_for_terraform/modules/aft-archives/../../src/aft_lambda/aft_account_provisioning_framework.zip"
      + function_name                  = "aft-account-provisioning-framework-account-metadata-ssm"
      + handler                        = "aft_account_provisioning_framework_account_metadata_ssm.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 1024
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "I4UGTSiO9JI6eeu6OP0vxnxoRVBq6FZFc8JsOfBCyMk="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "managed_by" = "AFT"
        }
      + timeout                        = 300
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = (known after apply)
          + subnet_ids         = (known after apply)
          + vpc_id             = (known after apply)
        }
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.create_role will be created
  + resource "aws_lambda_function" "create_role" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + description                    = "AFT account provisioning framework - create_role"
      + filename                       = ".terraform/modules/account_factory_for_terraform/modules/aft-archives/../../src/aft_lambda/aft_account_provisioning_framework.zip"
      + function_name                  = "aft-account-provisioning-framework-create-aft-execution-role"
      + handler                        = "aft_account_provisioning_framework_create_role.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 1024
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "I4UGTSiO9JI6eeu6OP0vxnxoRVBq6FZFc8JsOfBCyMk="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "managed_by" = "AFT"
        }
      + timeout                        = 300
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = (known after apply)
          + subnet_ids         = (known after apply)
          + vpc_id             = (known after apply)
        }
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.get_account_info will be created
  + resource "aws_lambda_function" "get_account_info" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + description                    = "AFT account provisioning framework - get_account_info"
      + filename                       = ".terraform/modules/account_factory_for_terraform/modules/aft-archives/../../src/aft_lambda/aft_account_provisioning_framework.zip"
      + function_name                  = "aft-account-provisioning-framework-get-account-info"
      + handler                        = "aft_account_provisioning_framework_get_account_info.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 1024
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "I4UGTSiO9JI6eeu6OP0vxnxoRVBq6FZFc8JsOfBCyMk="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "managed_by" = "AFT"
        }
      + timeout                        = 300
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = (known after apply)
          + subnet_ids         = (known after apply)
          + vpc_id             = (known after apply)
        }
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.persist_metadata will be created
  + resource "aws_lambda_function" "persist_metadata" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + description                    = "AFT account provisioning framework - persist_metadata"
      + filename                       = ".terraform/modules/account_factory_for_terraform/modules/aft-archives/../../src/aft_lambda/aft_account_provisioning_framework.zip"
      + function_name                  = "aft-account-provisioning-framework-persist-metadata"
      + handler                        = "aft_account_provisioning_framework_persist_metadata.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 1024
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "I4UGTSiO9JI6eeu6OP0vxnxoRVBq6FZFc8JsOfBCyMk="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "managed_by" = "AFT"
        }
      + timeout                        = 300
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = (known after apply)
          + subnet_ids         = (known after apply)
          + vpc_id             = (known after apply)
        }
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.tag_account will be created
  + resource "aws_lambda_function" "tag_account" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + description                    = "AFT account provisioning framework - tag_account"
      + filename                       = ".terraform/modules/account_factory_for_terraform/modules/aft-archives/../../src/aft_lambda/aft_account_provisioning_framework.zip"
      + function_name                  = "aft-account-provisioning-framework-tag-account"
      + handler                        = "aft_account_provisioning_framework_tag_account.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 1024
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "I4UGTSiO9JI6eeu6OP0vxnxoRVBq6FZFc8JsOfBCyMk="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "managed_by" = "AFT"
        }
      + timeout                        = 300
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = (known after apply)
          + subnet_ids         = (known after apply)
          + vpc_id             = (known after apply)
        }
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_lambda_function.validate_request will be created
  + resource "aws_lambda_function" "validate_request" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + description                    = "AFT account provisioning framework - validate_request"
      + filename                       = ".terraform/modules/account_factory_for_terraform/modules/aft-archives/../../src/aft_lambda/aft_account_provisioning_framework.zip"
      + function_name                  = "aft-account-provisioning-framework-validate-request"
      + handler                        = "aft_account_provisioning_framework_validate_request.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 1024
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "I4UGTSiO9JI6eeu6OP0vxnxoRVBq6FZFc8JsOfBCyMk="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "managed_by" = "AFT"
        }
      + timeout                        = 300
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = (known after apply)
          + subnet_ids         = (known after apply)
          + vpc_id             = (known after apply)
        }
    }

  # module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_sfn_state_machine.aft_account_provisioning_framework_sfn will be created
  + resource "aws_sfn_state_machine" "aft_account_provisioning_framework_sfn" {
      + arn           = (known after apply)
      + creation_date = (known after apply)
      + definition    = (known after apply)
      + id            = (known after apply)
      + name          = "aft-account-provisioning-framework"
      + role_arn      = (known after apply)
      + status        = (known after apply)
      + tags_all      = {
          + "managed_by" = "AFT"
        }
      + type          = "STANDARD"

      + logging_configuration {
          + include_execution_data = (known after apply)
          + level                  = (known after apply)
          + log_destination        = (known after apply)
        }

      + tracing_configuration {
          + enabled = (known after apply)
        }
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.data.aws_subnet_ids.codebuild will be read during apply
  # (config refers to values not yet known)
 <= data "aws_subnet_ids" "codebuild"  {
      + id     = (known after apply)
      + ids    = (known after apply)
      + tags   = (known after apply)
      + vpc_id = (known after apply)

      + filter {
          + name   = "availability-zone"
          + values = [
              + "ca-central-1a",
              + "ca-central-1b",
            ]
        }
      + filter {
          + name   = "subnet-id"
          + values = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.data.aws_subnet_ids.codecommit will be read during apply
  # (config refers to values not yet known)
 <= data "aws_subnet_ids" "codecommit"  {
      + id     = (known after apply)
      + ids    = (known after apply)
      + tags   = (known after apply)
      + vpc_id = (known after apply)

      + filter {
          + name   = "availability-zone"
          + values = [
              + "ca-central-1a",
              + "ca-central-1b",
              + "ca-central-1d",
            ]
        }
      + filter {
          + name   = "subnet-id"
          + values = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.data.aws_subnet_ids.codepipeline will be read during apply
  # (config refers to values not yet known)
 <= data "aws_subnet_ids" "codepipeline"  {
      + id     = (known after apply)
      + ids    = (known after apply)
      + tags   = (known after apply)
      + vpc_id = (known after apply)

      + filter {
          + name   = "availability-zone"
          + values = [
              + "ca-central-1a",
              + "ca-central-1b",
              + "ca-central-1d",
            ]
        }
      + filter {
          + name   = "subnet-id"
          + values = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.data.aws_subnet_ids.events will be read during apply
  # (config refers to values not yet known)
 <= data "aws_subnet_ids" "events"  {
      + id     = (known after apply)
      + ids    = (known after apply)
      + tags   = (known after apply)
      + vpc_id = (known after apply)

      + filter {
          + name   = "availability-zone"
          + values = [
              + "ca-central-1a",
              + "ca-central-1b",
              + "ca-central-1d",
            ]
        }
      + filter {
          + name   = "subnet-id"
          + values = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.data.aws_subnet_ids.git-codecommit will be read during apply
  # (config refers to values not yet known)
 <= data "aws_subnet_ids" "git-codecommit"  {
      + id     = (known after apply)
      + ids    = (known after apply)
      + tags   = (known after apply)
      + vpc_id = (known after apply)

      + filter {
          + name   = "availability-zone"
          + values = [
              + "ca-central-1a",
              + "ca-central-1b",
              + "ca-central-1d",
            ]
        }
      + filter {
          + name   = "subnet-id"
          + values = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.data.aws_subnet_ids.kms will be read during apply
  # (config refers to values not yet known)
 <= data "aws_subnet_ids" "kms"  {
      + id     = (known after apply)
      + ids    = (known after apply)
      + tags   = (known after apply)
      + vpc_id = (known after apply)

      + filter {
          + name   = "availability-zone"
          + values = [
              + "ca-central-1a",
              + "ca-central-1b",
              + "ca-central-1d",
            ]
        }
      + filter {
          + name   = "subnet-id"
          + values = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.data.aws_subnet_ids.lambda will be read during apply
  # (config refers to values not yet known)
 <= data "aws_subnet_ids" "lambda"  {
      + id     = (known after apply)
      + ids    = (known after apply)
      + tags   = (known after apply)
      + vpc_id = (known after apply)

      + filter {
          + name   = "availability-zone"
          + values = [
              + "ca-central-1a",
              + "ca-central-1b",
              + "ca-central-1d",
            ]
        }
      + filter {
          + name   = "subnet-id"
          + values = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.data.aws_subnet_ids.logs will be read during apply
  # (config refers to values not yet known)
 <= data "aws_subnet_ids" "logs"  {
      + id     = (known after apply)
      + ids    = (known after apply)
      + tags   = (known after apply)
      + vpc_id = (known after apply)

      + filter {
          + name   = "availability-zone"
          + values = [
              + "ca-central-1a",
              + "ca-central-1b",
              + "ca-central-1d",
            ]
        }
      + filter {
          + name   = "subnet-id"
          + values = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.data.aws_subnet_ids.servicecatalog will be read during apply
  # (config refers to values not yet known)
 <= data "aws_subnet_ids" "servicecatalog"  {
      + id     = (known after apply)
      + ids    = (known after apply)
      + tags   = (known after apply)
      + vpc_id = (known after apply)

      + filter {
          + name   = "availability-zone"
          + values = [
              + "ca-central-1a",
              + "ca-central-1b",
              + "ca-central-1d",
            ]
        }
      + filter {
          + name   = "subnet-id"
          + values = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.data.aws_subnet_ids.sns will be read during apply
  # (config refers to values not yet known)
 <= data "aws_subnet_ids" "sns"  {
      + id     = (known after apply)
      + ids    = (known after apply)
      + tags   = (known after apply)
      + vpc_id = (known after apply)

      + filter {
          + name   = "availability-zone"
          + values = [
              + "ca-central-1a",
              + "ca-central-1b",
              + "ca-central-1d",
            ]
        }
      + filter {
          + name   = "subnet-id"
          + values = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.data.aws_subnet_ids.sqs will be read during apply
  # (config refers to values not yet known)
 <= data "aws_subnet_ids" "sqs"  {
      + id     = (known after apply)
      + ids    = (known after apply)
      + tags   = (known after apply)
      + vpc_id = (known after apply)

      + filter {
          + name   = "availability-zone"
          + values = [
              + "ca-central-1a",
              + "ca-central-1b",
              + "ca-central-1d",
            ]
        }
      + filter {
          + name   = "subnet-id"
          + values = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.data.aws_subnet_ids.ssm will be read during apply
  # (config refers to values not yet known)
 <= data "aws_subnet_ids" "ssm"  {
      + id     = (known after apply)
      + ids    = (known after apply)
      + tags   = (known after apply)
      + vpc_id = (known after apply)

      + filter {
          + name   = "availability-zone"
          + values = [
              + "ca-central-1a",
              + "ca-central-1b",
              + "ca-central-1d",
            ]
        }
      + filter {
          + name   = "subnet-id"
          + values = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.data.aws_subnet_ids.states will be read during apply
  # (config refers to values not yet known)
 <= data "aws_subnet_ids" "states"  {
      + id     = (known after apply)
      + ids    = (known after apply)
      + tags   = (known after apply)
      + vpc_id = (known after apply)

      + filter {
          + name   = "availability-zone"
          + values = [
              + "ca-central-1a",
              + "ca-central-1b",
              + "ca-central-1d",
            ]
        }
      + filter {
          + name   = "subnet-id"
          + values = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.data.aws_subnet_ids.sts will be read during apply
  # (config refers to values not yet known)
 <= data "aws_subnet_ids" "sts"  {
      + id     = (known after apply)
      + ids    = (known after apply)
      + tags   = (known after apply)
      + vpc_id = (known after apply)

      + filter {
          + name   = "availability-zone"
          + values = [
              + "ca-central-1a",
              + "ca-central-1b",
              + "ca-central-1d",
            ]
        }
      + filter {
          + name   = "subnet-id"
          + values = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_backup_plan.aft_controltower_backup_plan will be created
  + resource "aws_backup_plan" "aft_controltower_backup_plan" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "aft-controltower-backup-plan"
      + tags_all = {
          + "managed_by" = "AFT"
        }
      + version  = (known after apply)

      + rule {
          + completion_window        = 180
          + enable_continuous_backup = false
          + rule_name                = "aft_controltower_backup_rule"
          + schedule                 = "cron(0 * * * ? *)"
          + start_window             = 60
          + target_vault_name        = "aft-controltower-backup-vault"
        }
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_backup_selection.aft_controltower_backup_selection will be created
  + resource "aws_backup_selection" "aft_controltower_backup_selection" {
      + iam_role_arn  = (known after apply)
      + id            = (known after apply)
      + name          = "aft-controltower-backup-selection"
      + not_resources = (known after apply)
      + plan_id       = (known after apply)
      + resources     = (known after apply)

      + condition {
        }
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_backup_vault.aft_controltower_backup_vault will be created
  + resource "aws_backup_vault" "aft_controltower_backup_vault" {
      + arn             = (known after apply)
      + id              = (known after apply)
      + kms_key_arn     = (known after apply)
      + name            = "aft-controltower-backup-vault"
      + recovery_points = (known after apply)
      + tags_all        = {
          + "managed_by" = "AFT"
        }
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_cloudwatch_event_bus.aft_from_ct_management will be created
  + resource "aws_cloudwatch_event_bus" "aft_from_ct_management" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "aft-events-from-ct-management"
      + tags_all = {
          + "managed_by" = "AFT"
        }
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_cloudwatch_event_permission.control_tower_management_account will be created
  + resource "aws_cloudwatch_event_permission" "control_tower_management_account" {
      + action         = "events:PutEvents"
      + event_bus_name = "aft-events-from-ct-management"
      + id             = (known after apply)
      + principal      = "659087519042"
      + statement_id   = "control_tower_management_account"
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_cloudwatch_event_rule.aft_account_request_processor will be created
  + resource "aws_cloudwatch_event_rule" "aft_account_request_processor" {
      + arn                 = (known after apply)
      + description         = "Trigger Lambda"
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "aft-lambda-account-request-processor"
      + name_prefix         = (known after apply)
      + schedule_expression = "rate(5 minutes)"
      + tags_all            = {
          + "managed_by" = "AFT"
        }
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_cloudwatch_event_rule.aft_control_tower_events will be created
  + resource "aws_cloudwatch_event_rule" "aft_control_tower_events" {
      + arn            = (known after apply)
      + description    = "Capture ControlTower events"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail      = {
                  + eventName = [
                      + "SetupLandingZone",
                      + "UpdateLandingZone",
                      + "RegisterOrganizationalUnit",
                      + "DeregisterOrganizationalUnit",
                      + "EnableGuardrail",
                      + "DisableGuardrail",
                      + "CreateManagedAccount",
                      + "UpdateManagedAccount",
                    ]
                }
              + detail-type = [
                  + "AWS Service Event via CloudTrail",
                ]
              + source      = [
                  + "aws.controltower",
                ]
            }
        )
      + id             = (known after apply)
      + is_enabled     = true
      + name           = "aft-capture-ct-events"
      + name_prefix    = (known after apply)
      + tags_all       = {
          + "managed_by" = "AFT"
        }
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_cloudwatch_event_rule.aft_controltower_event_trigger will be created
  + resource "aws_cloudwatch_event_rule" "aft_controltower_event_trigger" {
      + arn            = (known after apply)
      + description    = "Send CT Events to Lambda"
      + event_bus_name = "aft-events-from-ct-management"
      + event_pattern  = jsonencode(
            {
              + account = [
                  + "659087519042",
                ]
            }
        )
      + id             = (known after apply)
      + is_enabled     = true
      + name           = "aft-controltower-event-logger"
      + name_prefix    = (known after apply)
      + tags_all       = {
          + "managed_by" = "AFT"
        }
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_cloudwatch_event_target.aft_account_request_processor will be created
  + resource "aws_cloudwatch_event_target" "aft_account_request_processor" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = (known after apply)
      + target_id      = (known after apply)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_cloudwatch_event_target.aft_controltower_event_logger will be created
  + resource "aws_cloudwatch_event_target" "aft_controltower_event_logger" {
      + arn            = (known after apply)
      + event_bus_name = "aft-events-from-ct-management"
      + id             = (known after apply)
      + rule           = "aft-controltower-event-logger"
      + target_id      = (known after apply)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_cloudwatch_event_target.aft_invoke_aft_account_provisioning_framework will be created
  + resource "aws_cloudwatch_event_target" "aft_invoke_aft_account_provisioning_framework" {
      + arn            = (known after apply)
      + event_bus_name = "aft-events-from-ct-management"
      + id             = (known after apply)
      + rule           = "aft-controltower-event-logger"
      + target_id      = (known after apply)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_cloudwatch_event_target.aft_management_event_bus will be created
  + resource "aws_cloudwatch_event_target" "aft_management_event_bus" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + role_arn       = (known after apply)
      + rule           = (known after apply)
      + target_id      = (known after apply)
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_cloudwatch_log_group.aft_account_request_action_trigger will be created
  + resource "aws_cloudwatch_log_group" "aft_account_request_action_trigger" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/aft-account-request-action-trigger"
      + retention_in_days = 90
      + tags_all          = {
          + "managed_by" = "AFT"
        }
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_cloudwatch_log_group.aft_account_request_audit_trigger will be created
  + resource "aws_cloudwatch_log_group" "aft_account_request_audit_trigger" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/aft-account-request-audit-trigger"
      + retention_in_days = 90
      + tags_all          = {
          + "managed_by" = "AFT"
        }
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_cloudwatch_log_group.aft_account_request_processor will be created
  + resource "aws_cloudwatch_log_group" "aft_account_request_processor" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/aft-account-request-processor"
      + retention_in_days = 90
      + tags_all          = {
          + "managed_by" = "AFT"
        }
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_cloudwatch_log_group.aft_controltower_event_logger will be created
  + resource "aws_cloudwatch_log_group" "aft_controltower_event_logger" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/aft-controltower-event-logger"
      + retention_in_days = 90
      + tags_all          = {
          + "managed_by" = "AFT"
        }
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_cloudwatch_log_group.aft_invoke_aft_account_provisioning_framework will be created
  + resource "aws_cloudwatch_log_group" "aft_invoke_aft_account_provisioning_framework" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/aft-invoke-aft-account-provisioning-framework"
      + retention_in_days = 90
      + tags_all          = {
          + "managed_by" = "AFT"
        }
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_dynamodb_table.aft_controltower_events will be created
  + resource "aws_dynamodb_table" "aft_controltower_events" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "id"
      + id               = (known after apply)
      + name             = "aft-controltower-events"
      + range_key        = "time"
      + read_capacity    = 5
      + stream_arn       = (known after apply)
      + stream_enabled   = true
      + stream_label     = (known after apply)
      + stream_view_type = "NEW_AND_OLD_IMAGES"
      + tags_all         = {
          + "managed_by" = "AFT"
        }
      + write_capacity   = 5

      + attribute {
          + name = "id"
          + type = "S"
        }
      + attribute {
          + name = "time"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = true
        }

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = (known after apply)
        }

      + ttl {
          + attribute_name = (known after apply)
          + enabled        = (known after apply)
        }
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_dynamodb_table.aft_request will be created
  + resource "aws_dynamodb_table" "aft_request" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "id"
      + id               = (known after apply)
      + name             = "aft-request"
      + read_capacity    = 1
      + stream_arn       = (known after apply)
      + stream_enabled   = true
      + stream_label     = (known after apply)
      + stream_view_type = "NEW_AND_OLD_IMAGES"
      + tags_all         = {
          + "managed_by" = "AFT"
        }
      + write_capacity   = 1

      + attribute {
          + name = "id"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = true
        }

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = (known after apply)
        }

      + ttl {
          + attribute_name = (known after apply)
          + enabled        = (known after apply)
        }
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_dynamodb_table.aft_request_audit will be created
  + resource "aws_dynamodb_table" "aft_request_audit" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "id"
      + id               = (known after apply)
      + name             = "aft-request-audit"
      + range_key        = "timestamp"
      + read_capacity    = 1
      + stream_arn       = (known after apply)
      + stream_enabled   = true
      + stream_label     = (known after apply)
      + stream_view_type = "NEW_AND_OLD_IMAGES"
      + tags_all         = {
          + "managed_by" = "AFT"
        }
      + write_capacity   = 1

      + attribute {
          + name = "id"
          + type = "S"
        }
      + attribute {
          + name = "timestamp"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = true
        }

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = (known after apply)
        }

      + ttl {
          + attribute_name = (known after apply)
          + enabled        = (known after apply)
        }
    }

  # module.account_factory_for_terraform.module.aft_account_request_framework.aws_dynamodb_table.aft_request_metadata will be created
  + resource "aws_dynamodb_table" "aft_request_metadata" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "id"
      + id               = (known after apply)
      + name             = "aft-request-metadata"
      + read_capacity    = 1
      + stream_arn       = (known after apply)
      +...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_cloudwatch_log_group.account_metadata_ssm"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_cloudwatch_log_group.create_role"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_cloudwatch_log_group.get_account_info"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_cloudwatch_log_group.persist_metadata"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_cloudwatch_log_group.tag_account"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_cloudwatch_log_group.validate_request"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_iam_role.aft_lambda_aft_account_provisioning_framework_create_role"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_iam_role.aft_lambda_aft_account_provisioning_framework_get_account_info"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_iam_role.aft_lambda_aft_account_provisioning_framework_persist_metadata"]
WARN - plan.json - main - Missing Common Tags: ["module.account_factory_for_terraform.module.aft_account_provisioning_framework.aws_iam_role.aft_lambda_aft_account_provisioning_framework_tag_account"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
